In [1]:
import pandas as pd

In [4]:
#Q1
series=[4,8,15,16,23,42]
df=pd.Series(series)
print(df)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
#Q2
data=['shivani','sudh','ram',23,12.28,46,57,'sdse5',565,'232i']
df=pd.Series(data)
print(df)

0    shivani
1       sudh
2        ram
3         23
4      12.28
5         46
6         57
7      sdse5
8        565
9       232i
dtype: object

In [10]:
#Q3
data=[['alice',25,'female'],['bob',30,'male'],['claire',27,'female']]
df=pd.DataFrame(data,columns=['Name','Age','gender'])
print(df)

     Name  Age  gender
0   alice   25  female
1     bob   30    male
2  claire   27  female

In [ ]:
#Q4

In [19]:

data=[['alice',25,'female'],['bob',30,'male'],['claire',27,'female']]
df=pd.DataFrame(data,columns=['Name','Age','gender'])
type(df['Name'])

pandas.core.series.Series

In [18]:
data=[['alice',25,'female'],['bob',30,'male'],['claire',27,'female']]
df=pd.DataFrame(data,columns=['Name','Age','gender'])
type(df[['Name']])

pandas.core.frame.DataFrame

In [ ]:
#Q5

In [22]:
df=pd.read_csv('test.csv')
#display
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

    name  marks  gender
0    ram      5    male
1  shyam     67    male
2  nidhi     45  female
3     om     86    male
4  shita     68  female
5   gita     87  female

In [23]:
df.head(3)

    name  marks  gender
0    ram      5    male
1  shyam     67    male
2  nidhi     45  female

In [24]:
df.shape

(6, 3)

In [25]:
df.describe()

           marks
count   6.000000
mean   59.666667
std    30.878256
min     5.000000
25%    50.500000
50%    67.500000
75%    81.500000
max    87.000000

In [27]:
data=df.rename(columns={'name':'studentname'},inplace=False)
data

  studentname  marks  gender
0         ram      5    male
1       shyam     67    male
2       nidhi     45  female
3          om     86    male
4       shita     68  female
5        gita     87  female

In [ ]:
#Q6

In [28]:
DATA1=['RAM','SHYAM','OM']
DATA2=[21,12,23]
DF1=pd.Series(DATA1)
DF2=pd.Series(DATA2)
FRAME={'STUDENTS':DF1,'MARKS':DF2}
RESULT=pd.DataFrame(FRAME)
print(RESULT)

NameError: name 'PRINT' is not defined